package by.htp.line_task.main;

//15. Написать программу, которая выводит на экран первые четыре степени числа Пи.

public class Task15 {

	public static void main(String[] args) {
		
		System.out.println("Пи в первой степени равно = " + Math.pow(Math.PI, 1));
		System.out.println("Пи во второй степени равно = " + Math.pow(Math.PI, 2));
		System.out.println("Пи в третьей степени равно = " + Math.pow(Math.PI, 3));
		System.out.println("Пи в четвёртой степени равно = " + Math.pow(Math.PI, 4));
	}

}
