package by.htp.cycle_task.main;

/*4. С помощью оператора while напишите программу вывода всех четных чисел в диапазоне
от 2 до 100 включительно.*/

public class Task4 {

	public static void main(String[] args) {
		
		int x;
		x = 2;
		
		while (x <= 100)
		{
		System.out.println(x);
		x=x+2;
		}
		
	}
}
